# Data-Wrangling
- pip install pandas
- pip install numpy
- pip install seabon

In [63]:
# import Libraries
import pandas as pd
import numpy as n
import seaborn as sns

In [64]:
ds = sns.load_dataset('titanic')
ds1 = ds
ds2 = ds

In [65]:
ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [66]:
#  Math operations
(ds["fare"]+1).head()

0     8.2500
1    72.2833
2     8.9250
3    54.1000
4     9.0500
Name: fare, dtype: float64

In [67]:
# Check all null or missing values in dataset
ds.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# how to tackle missing values

## 1. drop selected feature with missing values

In [68]:
# 1. drop selected feature with missing values
ds.dropna(subset=["deck"], axis=0 , inplace=True)
ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [69]:
ds.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [70]:
# remove all Na values from dataset
ds = ds.dropna()

In [71]:
ds.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [72]:
ds.shape

(182, 15)

## 2. replace selected features missing values with its average

In [73]:
# using mean to replace nan values of selceted feature
import numpy as np
ds1["age"] = ds1["age"].replace(np.nan ,ds1["age"].mean())

In [74]:
ds1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [75]:
ds1.shape

(203, 15)

In [76]:
ds1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [77]:
# droping embarked feature values
ds1.dropna(subset=["embarked"], axis=0 , inplace=True)

In [78]:
ds1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [79]:
ds1.shape

(201, 15)

In [80]:
# store data set in csv file
ds1.to_csv("titanic.csv")